In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={
    "name":['Taweshal','Dev','MS','Sweta'],
    "marks":[96,40,26,34],
    "city":['Janakpur','Sarlahi','Belauri','Siaraha']
}

In [3]:
df=pd.DataFrame(dict1)

In [4]:
df

       name  marks      city
0  Taweshal     96  Janakpur
1       Dev     40   Sarlahi
2        MS     26   Belauri
3     Sweta     34   Siaraha

In [5]:
df.to_csv('friends.csv')

In [7]:
df.to_csv('friends_index_false.csv',index=False)

In [8]:
df.head(2)

       name  marks      city
0  Taweshal     96  Janakpur
1       Dev     40   Sarlahi

In [9]:
df.tail(1)

    name  marks     city
3  Sweta     34  Siaraha

In [10]:
df.describe

<bound method NDFrame.describe of        name  marks      city
0  Taweshal     96  Janakpur
1       Dev     40   Sarlahi
2        MS     26   Belauri
3     Sweta     34   Siaraha>

In [11]:
df.describe()

           marks
count   4.000000
mean   49.000000
std    31.853833
min    26.000000
25%    32.000000
50%    37.000000
75%    54.000000
max    96.000000

In [18]:
data=pd.read_csv('data.csv')

In [20]:
data

   Unnamed: 0  Train_No  Id_No      city
0           0     98765     96  Janakpur
1           1      8654     40   Sarlahi
2           2    989797     26   Belauri
3           3      8688     34   Siaraha

In [21]:
data['Id_No']

0    96
1    40
2    26
3    34
Name: Id_No, dtype: int64

In [22]:
data['Id_No'][0]

np.int64(96)

In [23]:
data['Id_No'][0]=69

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_11948\910429908.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['Id_No'][0]=69

In [24]:
data

   Unnamed: 0  Train_No  Id_No      city
0           0     98765     69  Janakpur
1           1      8654     40   Sarlahi
2           2    989797     26   Belauri
3           3      8688     34   Siaraha

In [1]:
data.to_csv('data.csv')

NameError: name 'data' is not defined